# Задание 1
x = 10.5
y = 3.2

print(x + y) # Выведит 13.7 (сложение)
print(x - y) # Выведит 7.3 (вычитание)
print(x * y) # Выведит 33.6 (умножение)
print(x / y) # Выведит 3.28125 (деление)
print(x ** y) # Выведит 1852.7027964066515 (возведение в степень)

# Задание 2
price = 19.99
quantity = 3

total = price * quantity

print("Итоговая стоймость", total) # Выведит 59.97

# Задание 3
radius = 7.5

area = 3.14159 * radius ** 2

print("Площадь круга с данным радиусом", area)

# Задание 4
weight_kg = 75.8

weight_lb = weight_kg * 2.20462
print(f"{weight_kg} кг = {weight_lb:.2f} фунтов") # Выводим результат с округлением до 2 знаков после запятой