# Деление с остатком — операторы // и %
# Задание 1
x = 25
y = 4

quotient = (x // y) # Используем оператор //, чтобы найти целую часть от деления x на y
print(quotient)

# Задание 2
total_seconds = 7853

minutes = total_seconds // 60 # Делим на 60 минут что бы узнать кол-во минут
print(minutes)

# Задание 3
a = 47
b = 5

div_count = (a // b) # Целочисленное деление
leftover = (a % b) # Остаток от деления

print(div_count)
print(leftover)