# Задание 2
print("Hello") # print "Hello" было отсутсвие скобок

len("abc") # len "abc" неверный синтаксис

input("Введите число: ") # input "Введите число" неверный синтаксис

# Задание 3 - Напечатать сумму всех чисел в диапазоне от 1 до 20 - выполнить эту задачу в 1 строку
for i in range(1, 21):
    print(i, end=' ') # for начало цикла, i переменна на которую по очереди будет попадать каждое число, in это в, range(2, 21, 2) — создаёт последовательность чисел
